---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExportPatternTableIterator
source: html/a345f704-12f9-90cf-bc7c-afc6b1ac4075.htm
---
# ExportPatternTableIterator Members

Releases all resources used by the ExportPatternTableIterator